base/Documents/бит_пз_СводнаяЗаявкаНаЗатраты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_пз_СводнаяЗаявкаНаЗатраты</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.бит_пз_ПланируемыеЗатраты</xr:Item>
				<xr:Item>AccumulationRegister.бит_пз_ПланируемыеЗатратыАналитика</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_пз_ВидыОперацийЗаявокНаЗатраты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЖелаемаяДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_Важность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Comment>Ручная корректировка - служебный реквизит</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсДокумента</Name>
					<Comment>Курс документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьДокумента</Name>
					<Comment>Кратность документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗаявкиНаЗатраты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяОборотов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦФО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
								<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьСтавкаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СтавкаНДС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПоступления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_4</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_5</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_6</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_7</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_8</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_9</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_10</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_11</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_12</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаявкаНаЗатраты</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.бит_пз_ЗаявкаНаЗатраты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.бит_СтавкаНДС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

base/AccumulationRegisters/бит_пз_ПланируемыеЗатраты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>бит_пз_ПланируемыеЗатраты</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПланирования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_пз_ЗаявкаНаЗатраты</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_пз_СводнаяЗаявкаНаЗатраты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаявкаНаЗатраты</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_пз_ЗаявкаНаЗатраты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

base/Documents/бит_пз_СводнаяЗаявкаНаЗатраты/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
	
#Область ОбновлениеИнформационнойБазы

#КонецОбласти

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.Печать

// Переопределяет настройки печати для объекта.
//
// Параметры:
//  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
//
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
		
КонецПроцедуры

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать
	
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Функция получает остатки из регистра Планируемые затраты.
//
// Параметры:
//   СводнаяЗаявка - ДокументСсылка.бит_пз_СводнаяЗаявка
//
// Возвращаемое значение:
//  СтрОплата - Структура.
//
Функция ПолучитьОстатки(СводнаяЗаявка) Экспорт

	СтрОплата = Новый Структура("КоличествоПлан, КоличествоФакт, КоличествоОстаток",0, 0, 0);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументПланирования", СводнаяЗаявка);
	Запрос.УстановитьПараметр("Организация"         , СводнаяЗаявка.Организация);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СУММА(ЕСТЬNULL(ПланируемыеЗатраты.КоличествоКонечныйОстаток, 0)) КАК КоличествоОстаток,
	               |	СУММА(ЕСТЬNULL(ПланируемыеЗатраты.КоличествоПриход, 0)) КАК КоличествоПлан,
	               |	СУММА(ЕСТЬNULL(ПланируемыеЗатраты.КоличествоРасход, 0)) КАК КоличествоФакт
	               |ИЗ
	               |	Документ.бит_пз_СводнаяЗаявкаНаЗатраты.ЗаявкиНаЗатраты КАК ТЧСводнаяЗаявка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.бит_пз_ПланируемыеЗатраты.ОстаткиИОбороты(, , , , Организация = &Организация) КАК ПланируемыеЗатраты
	               |		ПО ТЧСводнаяЗаявка.Ссылка = ПланируемыеЗатраты.ДокументПланирования
	               |			И ТЧСводнаяЗаявка.ЗаявкаНаЗатраты = ПланируемыеЗатраты.ЗаявкаНаЗатраты
	               |			И ТЧСводнаяЗаявка.Номенклатура = ПланируемыеЗатраты.Номенклатура
	               |			И ТЧСводнаяЗаявка.Характеристика = ПланируемыеЗатраты.Характеристика
	               |ГДЕ
	               |	ТЧСводнаяЗаявка.Ссылка = &ДокументПланирования";
				   
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
	
		СтрОплата.КоличествоПлан    = ?(ЗначениеЗаполнено(Выборка.КоличествоПлан), Выборка.КоличествоПлан, 0);
		СтрОплата.КоличествоФакт    = ?(ЗначениеЗаполнено(Выборка.КоличествоФакт), Выборка.КоличествоФакт, 0);
		СтрОплата.КоличествоОстаток = ?(ЗначениеЗаполнено(Выборка.КоличествоОстаток), Выборка.КоличествоОстаток, 0);
	
	КонецЕсли; 

	Возврат СтрОплата;
	
КонецФункции // ПолучитьОстатки()

// Функция определяет новый статус объекта в зависимости от режима записи документа
//и предыдущего статуса. Механизм определения статусов может быть переопределен алгоритмами.
//
// Параметры:
//  ТекущийОбъект - ДокументОбъект.бит_пз_ЗаявкаНаЗатраты.
//  ПараметрыУстановкиСтатуса - Структура - состав полей см. в функции бит_ВизированиеСервер.НовыеПараметрыУстановкиСтатуса.
//
// Возвращаемое значение:
//   НовыйСтатус - СправочникСсылка.бит_СтатусыОбъектов.
//
Функция НовыйСтатусОбъекта(ТекущийОбъект, ПараметрыУстановкиСтатуса) Экспорт
	
	Если ПараметрыУстановкиСтатуса.ТекущийСтатус = Справочники.бит_СтатусыОбъектов.Закрыт Тогда
		Возврат ПараметрыУстановкиСтатуса.ТекущийСтатус;
	КонецЕсли;
		
	Если ПараметрыУстановкиСтатуса.ПараметрыОплаты = Неопределено Тогда
		СтруктураОплаты = ПолучитьОстатки(ТекущийОбъект.Ссылка);
	Иначе	
		СтруктураОплаты = ПараметрыУстановкиСтатуса.ПараметрыОплаты;
	КонецЕсли;
	
	РежимЗаписи = ПараметрыУстановкиСтатуса.РежимЗаписи;
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения
		ИЛИ (РежимЗаписи = РежимЗаписиДокумента.Запись И НЕ ТекущийОбъект.Проведен) Тогда
		Возврат Справочники.бит_СтатусыОбъектов.Черновик;
	КонецЕсли;
	
	СсылкаНаОбъект = ТекущийОбъект.Ссылка;
	
	ОтменаСводнойЗаявки = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ТекущийОбъект.ДополнительныеСвойства, "ОтменаСводнойЗаявки", Ложь);
	
	Если бит_ВизированиеСервер.ЕстьБлокирующиеРешения(СсылкаНаОбъект) Тогда
		
		Возврат Справочники.бит_СтатусыОбъектов.Отклонен;
		
	ИначеЕсли СтруктураОплаты.КоличествоОстаток <= 0.01 И СтруктураОплаты.КоличествоФакт > 0 Тогда
		
		Возврат Справочники.бит_СтатусыОбъектов.ЗаявкаНаЗатраты_Исполнена;
		
	ИначеЕсли СтруктураОплаты.КоличествоФакт > 0 Тогда
		
		Возврат Справочники.бит_СтатусыОбъектов.ЗаявкаНаЗатраты_ЧастичноИсполнена;
		
	ИначеЕсли бит_ВизированиеСервер.ВсеВизыСогласованы(СсылкаНаОбъект) Тогда
		
		Возврат Справочники.бит_СтатусыОбъектов.Утвержден;
		
	КонецЕсли;
	
	Возврат Справочники.бит_СтатусыОбъектов.НаСогласовании;
	
КонецФункции

#КонецОбласти

#КонецЕсли
